SloMusti/ArduinoCore-stm32l0/boards.txt
MURATA-ABZ.menu.opt.os=Smallest Code
MURATA-ABZ.menu.opt.os.build.flags.optimize=-Os
MURATA-ABZ.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
MURATA-ABZ.menu.opt.o1=Fast
MURATA-ABZ.menu.opt.o1.build.flags.optimize=-O1
MURATA-ABZ.menu.opt.o1.build.flags.ldspecs=
MURATA-ABZ.menu.opt.o2=Faster
MURATA-ABZ.menu.opt.o2.build.flags.optimize=-O2
MURATA-ABZ.menu.opt.o2.build.flags.ldspecs=
MURATA-ABZ.menu.opt.o3=Fastest
MURATA-ABZ.menu.opt.o3.build.flags.optimize=-O3
MURATA-ABZ.menu.opt.o3.build.flags.ldspecs=

# IRNAS Rhino-L0722Z
# ---------------------------------------
Rhino-L0722Z.name=Rhino-L0722Z
Rhino-L0722Z.vid.0=0x0483
Rhino-L0722Z.pid.0=0x374b

Rhino-L0722Z.upload.tool=stm32l0_openocd
Rhino-L0722Z.upload.protocol=stlink
Rhino-L0722Z.upload.maximum_size=196608
Rhino-L0722Z.upload.maximum_data_size=20480
Rhino-L0722Z.upload.use_1200bps_touch=true
Rhino-L0722Z.upload.wait_for_upload_port=false
Rhino-L0722Z.upload.native_usb=false

Rhino-L0722Z.build.mcu=cortex-m0plus
Rhino-L0722Z.build.f_cpu=32000000L
Rhino-L0722Z.build.board=STM32_Rhino-L0722Z
Rhino-L0722Z.build.arch=stm32l0
Rhino-L0722Z.build.core=arduino
Rhino-L0722Z.build.vid=0x0483
Rhino-L0722Z.build.pid=0x374b
Rhino-L0722Z.build.did=0xffff
Rhino-L0722Z.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
Rhino-L0722Z.build.ldscript=linker_scripts/STM32L072CZ_FLASH.ld
Rhino-L0722Z.build.openocdscript=openocd_scripts/murata-abz.cfg
Rhino-L0722Z.build.variant=Rhino-L0722Z
Rhino-L0722Z.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
Rhino-L0722Z.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

Rhino-L0722Z.menu.speed.32=32 MHz
Rhino-L0722Z.menu.speed.32.build.f_cpu=32000000L
Rhino-L0722Z.menu.speed.16=16 MHz (No USB)
Rhino-L0722Z.menu.speed.16.build.f_cpu=16000000L
Rhino-L0722Z.menu.speed.4=4.2 MHz (No USB)
Rhino-L0722Z.menu.speed.4.build.f_cpu=4200000L
Rhino-L0722Z.menu.tcxo.pa12=TCXO PA12
Rhino-L0722Z.menu.tcxo.pa12.build.pin_tcxo=PA12
Rhino-L0722Z.menu.tcxo.ph1=TCXO PH1
Rhino-L0722Z.menu.tcxo.ph1.build.pin_tcxo=PH1

Rhino-L0722Z.menu.opt.os=Smallest Code
Rhino-L0722Z.menu.opt.os.build.flags.optimize=-Os
Rhino-L0722Z.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Rhino-L0722Z.menu.opt.o1=Fast
Rhino-L0722Z.menu.opt.o1.build.flags.optimize=-O1
Rhino-L0722Z.menu.opt.o1.build.flags.ldspecs=
Rhino-L0722Z.menu.opt.o2=Faster
Rhino-L0722Z.menu.opt.o2.build.flags.optimize=-O2
Rhino-L0722Z.menu.opt.o2.build.flags.ldspecs=
Rhino-L0722Z.menu.opt.o3=Fastest
Rhino-L0722Z.menu.opt.o3.build.flags.optimize=-O3
Rhino-L0722Z.menu.opt.o3.build.flags.ldspecs=

# IRNAS B-Colibri-L072Z
# ---------------------------------------
IRNAS-env-module-L072Z.name=IRNAS-env-module-L072Z
IRNAS-env-module-L072Z.vid.0=0x0483
IRNAS-env-module-L072Z.pid.0=0x374b

IRNAS-env-module-L072Z.upload.tool=stm32l0_openocd
IRNAS-env-module-L072Z.upload.protocol=stlink
IRNAS-env-module-L072Z.upload.maximum_size=196608
IRNAS-env-module-L072Z.upload.maximum_data_size=20480
IRNAS-env-module-L072Z.upload.use_1200bps_touch=true
IRNAS-env-module-L072Z.upload.wait_for_upload_port=false
IRNAS-env-module-L072Z.upload.native_usb=false

IRNAS-env-module-L072Z.build.mcu=cortex-m0plus
IRNAS-env-module-L072Z.build.f_cpu=32000000L
IRNAS-env-module-L072Z.build.board=STM32L0_B_L072Z_LRWAN1
IRNAS-env-module-L072Z.build.arch=stm32l0
IRNAS-env-module-L072Z.build.core=arduino
IRNAS-env-module-L072Z.build.vid=0x0483
IRNAS-env-module-L072Z.build.pid=0x374b
IRNAS-env-module-L072Z.build.did=0xffff
IRNAS-env-module-L072Z.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
IRNAS-env-module-L072Z.build.ldscript=linker_scripts/STM32L072CZ_FLASH.ld
IRNAS-env-module-L072Z.build.openocdscript=openocd_scripts/IRNAS-env-module-L072Z.cfg
IRNAS-env-module-L072Z.build.variant=IRNAS-env-module-L072Z
IRNAS-env-module-L072Z.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
IRNAS-env-module-L072Z.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

IRNAS-env-module-L072Z.menu.speed.32=32 MHz
IRNAS-env-module-L072Z.menu.speed.32.build.f_cpu=32000000L
IRNAS-env-module-L072Z.menu.speed.16=16 MHz (No USB)
IRNAS-env-module-L072Z.menu.speed.16.build.f_cpu=16000000L
IRNAS-env-module-L072Z.menu.speed.4=4.2 MHz (No USB)
IRNAS-env-module-L072Z.menu.speed.4.build.f_cpu=4200000L

IRNAS-env-module-L072Z.menu.opt.os=Smallest Code
IRNAS-env-module-L072Z.menu.opt.os.build.flags.optimize=-Os
IRNAS-env-module-L072Z.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
IRNAS-env-module-L072Z.menu.opt.o1=Fast
IRNAS-env-module-L072Z.menu.opt.o1.build.flags.optimize=-O1
IRNAS-env-module-L072Z.menu.opt.o1.build.flags.ldspecs=
IRNAS-env-module-L072Z.menu.opt.o2=Faster
IRNAS-env-module-L072Z.menu.opt.o2.build.flags.optimize=-O2
IRNAS-env-module-L072Z.menu.opt.o2.build.flags.ldspecs=
IRNAS-env-module-L072Z.menu.opt.o3=Fastest
IRNAS-env-module-L072Z.menu.opt.o3.build.flags.optimize=-O3
IRNAS-env-module-L072Z.menu.opt.o3.build.flags.ldspecs=

# microclimate-L072Z
# ---------------------------------------
microclimate-L072Z.name=microclimate-L072Z
microclimate-L072Z.vid.0=0x0483
microclimate-L072Z.pid.0=0x374b

microclimate-L072Z.upload.tool=stm32l0_openocd
microclimate-L072Z.upload.protocol=stlink
microclimate-L072Z.upload.maximum_size=196608
microclimate-L072Z.upload.maximum_data_size=20480
microclimate-L072Z.upload.use_1200bps_touch=true
microclimate-L072Z.upload.wait_for_upload_port=false
microclimate-L072Z.upload.native_usb=false

microclimate-L072Z.build.mcu=cortex-m0plus
microclimate-L072Z.build.f_cpu=32000000L
microclimate-L072Z.build.board=STM32L0_B_L072Z_LRWAN1
microclimate-L072Z.build.arch=stm32l0
microclimate-L072Z.build.core=arduino
microclimate-L072Z.build.vid=0x0483
microclimate-L072Z.build.pid=0x374b
microclimate-L072Z.build.did=0xffff
microclimate-L072Z.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
microclimate-L072Z.build.ldscript=linker_scripts/STM32L072CZ_FLASH.ld
microclimate-L072Z.build.openocdscript=openocd_scripts/microclimate-L072Z.cfg
microclimate-L072Z.build.variant=microclimate-L072Z
microclimate-L072Z.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
microclimate-L072Z.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

microclimate-L072Z.menu.speed.32=32 MHz
microclimate-L072Z.menu.speed.32.build.f_cpu=32000000L
microclimate-L072Z.menu.speed.16=16 MHz (No USB)
microclimate-L072Z.menu.speed.16.build.f_cpu=16000000L
microclimate-L072Z.menu.speed.4=4.2 MHz (No USB)
microclimate-L072Z.menu.speed.4.build.f_cpu=4200000L

microclimate-L072Z.menu.opt.os=Smallest Code
microclimate-L072Z.menu.opt.os.build.flags.optimize=-Os
microclimate-L072Z.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
microclimate-L072Z.menu.opt.o1=Fast
microclimate-L072Z.menu.opt.o1.build.flags.optimize=-O1
microclimate-L072Z.menu.opt.o1.build.flags.ldspecs=
microclimate-L072Z.menu.opt.o2=Faster
microclimate-L072Z.menu.opt.o2.build.flags.optimize=-O2
microclimate-L072Z.menu.opt.o2.build.flags.ldspecs=
microclimate-L072Z.menu.opt.o3=Fastest
microclimate-L072Z.menu.opt.o3.build.flags.optimize=-O3
microclimate-L072Z.menu.opt.o3.build.flags.ldspecs=

# irnas-lora-addon-L073RZ
# ---------------------------------------
irnas-lora-addon-L073RZ.name=irnas-lora-addon-L073RZ
irnas-lora-addon-L073RZ.vid.0=0x1209
irnas-lora-addon-L073RZ.pid.0=0x6662

irnas-lora-addon-L073RZ.upload.tool=stm32l0_openocd
irnas-lora-addon-L073RZ.upload.protocol=stlink
irnas-lora-addon-L073RZ.upload.maximum_size=196608
irnas-lora-addon-L073RZ.upload.maximum_data_size=20480
irnas-lora-addon-L073RZ.upload.use_1200bps_touch=true
irnas-lora-addon-L073RZ.upload.wait_for_upload_port=false
irnas-lora-addon-L073RZ.upload.native_usb=false

irnas-lora-addon-L073RZ.build.mcu=cortex-m0plus
irnas-lora-addon-L073RZ.build.f_cpu=32000000L
irnas-lora-addon-L073RZ.build.board=STM32L0_IRNAS
irnas-lora-addon-L073RZ.build.arch=stm32l0
irnas-lora-addon-L073RZ.build.core=arduino
irnas-lora-addon-L073RZ.build.vid=0x1209
irnas-lora-addon-L073RZ.build.pid=0x6662
irnas-lora-addon-L073RZ.build.did=0xffff
irnas-lora-addon-L073RZ.build.usb_manufacturer="IRNAS"
irnas-lora-addon-L073RZ.build.usb_product="irnas-lora"
irnas-lora-addon-L073RZ.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
irnas-lora-addon-L073RZ.build.ldscript=linker_scripts/STM32L073RZ_FLASH.ld
irnas-lora-addon-L073RZ.build.openocdscript=openocd_scripts/irnas-lora-addon-L073RZ.cfg
irnas-lora-addon-L073RZ.build.variant=irnas-lora-addon-L073RZ
irnas-lora-addon-L073RZ.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
irnas-lora-addon-L073RZ.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

irnas-lora-addon-L073RZ.menu.usb.cdc=Serial
irnas-lora-addon-L073RZ.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
irnas-lora-addon-L073RZ.menu.usb.cdc_hid=Serial + Keyboard + Mouse
irnas-lora-addon-L073RZ.menu.usb.cdc_hid.build.usb_type=USB_TYPE_CDC_HID
irnas-lora-addon-L073RZ.menu.usb.none=No USB
irnas-lora-addon-L073RZ.menu.usb.none.build.usb_type=USB_TYPE_NONE

irnas-lora-addon-L073RZ.menu.speed.32=32 MHz
irnas-lora-addon-L073RZ.menu.speed.32.build.f_cpu=32000000L
irnas-lora-addon-L073RZ.menu.speed.16=16 MHz (No USB)
irnas-lora-addon-L073RZ.menu.speed.16.build.f_cpu=16000000L
irnas-lora-addon-L073RZ.menu.speed.4=4.2 MHz (No USB)
irnas-lora-addon-L073RZ.menu.speed.4.build.f_cpu=4200000L

irnas-lora-addon-L073RZ.menu.opt.os=Smallest Code
irnas-lora-addon-L073RZ.menu.opt.os.build.flags.optimize=-Os
irnas-lora-addon-L073RZ.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
irnas-lora-addon-L073RZ.menu.opt.o1=Fast
irnas-lora-addon-L073RZ.menu.opt.o1.build.flags.optimize=-O1
irnas-lora-addon-L073RZ.menu.opt.o1.build.flags.ldspecs=
irnas-lora-addon-L073RZ.menu.opt.o2=Faster
irnas-lora-addon-L073RZ.menu.opt.o2.build.flags.optimize=-O2
irnas-lora-addon-L073RZ.menu.opt.o2.build.flags.ldspecs=
irnas-lora-addon-L073RZ.menu.opt.o3=Fastest
irnas-lora-addon-L073RZ.menu.opt.o3.build.flags.optimize=-O3
irnas-lora-addon-L073RZ.menu.opt.o3.build.flags.ldspecs=
